{
    "@context": [
        "http://www.w3.org/ns/csvw",
        {
            "@language": "en"
        }
    ],
    "dc:bibliographicCitation": "Seifart, Frank. 2013. AfBo: A world-wide survey of affix borrowing. Leipzig: Max Planck Institute for Evolutionary Anthropology.",
    "dc:conformsTo": "http://cldf.clld.org/v1.0/terms.rdf#StructureDataset",
    "dc:creator": "Frank Seifart",
    "dc:description": "# About AfBo\n\n## Data sources\n\nInformation on borrowed affixes was compiled by Frank Seifart from a variety of sources, as explicitly indicated for each case. Most information comes from published sources, especially descriptive grammars and other descriptive studies on, e.g., language contact or morphology. Different sources on the same language were consulted wherever possible. In many cases important additional information (and in some cases, all information) comes from personal communications from experts on the languages in question.\n\n\n## Language sample\n\nThe sample of languages includes in principle all cases of affix borrowing that have come to my attention between 2007 and 2013, i.e. no attempt has been made to make the sample genealogically or areally balanced. If two or more pairs of languages (or dialects) are very similar in the aspects relevant here, only one pair has been included in the database, namely the language pair with the higher number of borrowed affixes. For instance, Chuvash (Turkic) affixes in Mari (Uralic) are included in the database, but excluded is the similar set of Chuvash affixes that the Mordvinian languages borrowed, which are closely related to Mari.\n\nThere is a clear bias in the language sample towards those language families and areas that are linguistically best described, especially European/Western Eurasian and Oriental languages. This is because detecting affix borrowing requires relatively detailed information not only on the recipient and donor language but crucially also comparative evidence from both of these languages for the proof of borrowing and determining the direction of borrowing.\n\nIncluded in the sample are two languages that are often considered as \"mixed languages\", Gurindji Kriol from Northern Australia and Copper Island Aleut from the Commander Islands in the Bering Strait. Unlike other mixed languages, it is possible for these two to clearly identify one language as the matrix language (Myers-Scotton 2002; Myers-Scotton 2007), which contributes the morphosyntactic framework as well as a substantial portion of the vocabulary. This language is identified as the recipient language (English for Gurindji Kriol and Aleut for Copper Island Aleut) and the other contributing languages as the donor language (Gurindji for Gurindji Kriol and Russian for Copper Island Aleut), following Meakins' (2011) analysis of (English-based) Gurindji Kriol as having borrowed Gurindji case markers. Note that in AfBo, Gurindji Kriol and Copper Island Aleut do not appear as borrowing exceptionally many affixes: Gurindji Kriol is the sixth most heavily affix-borrowing language in the sample, Copper Island Aleut the ninth.\n\n\n## What counts as an affix?\n\nAny morphologically bound form from a closed class that fulfills a derivational or inflectional function counts as an affix in AfBo. By this definition, clitics are included as instances of affix borrowing, as long as they fulfill a derivational or inflectional function, e.g. tense, evidentiality, or topic marking. Potential doubts whether a given form is a bound or a free are explicitly noted in the descriptions and often a reason to consider such a case as less reliable (see below).\n\nSome forms are included here that might be considered morphologically conditioned allomorphs because they fulfill the same function in different environments. For instance, a plural marker used with animate nouns and a plural marker used with inanimate nouns are counted as two borrowed affixes.\n\n\n## Proof of borrowing\n\nAn affix is considered as effectively borrowed only if it is used on at least some native stems, i.e. it is not considered as borrowed if it only combines with equally borrowed stems, forming complex loanwords. In addition, a complete proof that a given affix is borrowed would ideally include (i) evidence that the borrowed affix was not present in the recipient language before contact, (ii) evidence that the source form was present in the donor language at the time of contact, and (iii) evidence that the similarity between source form and borrowed form is not coincidental. Even though the sources consulted for AfBo rarely if ever explicitly provide such complete information, the authors of these sources are often authorities in the language families concerned, which gives credibility to their judgments that a given form is borrowed.\n\n\n## Data coding\n\nData are coded for a number of properties for comparative analyses (note that parts of this information are included in the web interface, while other parts are included in the downloadable database). Information on recipient languages involved in affix borrowing include:\n\n1. language name\n2. genealogical affiliation\n3. iso 639-3 language identification code\n4. an approximate geographic location\n5. affiliation with a geographic macro area\n\nFor each recipient language, additionally the following information is provided:\n\n1. the total number of borrowed affixes\n2. the total number of interrelated borrowed affixes in the sense of Seifart (2012)\n3. reliability of borrowed status/affixhood\n\nThe information provided for each borrowed affix consists of the following:\n\n1. form of the borrowed affix\n2. approximate function (e.g. agent nominalizer) and distribution (e.g. forming nouns from adjectives)\n3. examples of hybrid formations, i.e. combinations of borrowed affixes with native stems, for over 500 borrowed affixes. In the remaining cases, the original sources explicitly state that the form is used on native stems.\n4. based on the approximate functions and distributions of borrowed affixes, these are grouped into morphosyntactic subsystems and the overall number of borrowed affixes per subsystem is given (e.g. three nominalizer that form nouns from adjectives, two case markers, and one number marker)\n5. Where possible, the overall number of forms in recipient language subsystems into which affixes were borrowed is given (e.g., three out of a total of five case markers are borrowed)\n\n## Reliability of borrowed status and affixhood\n\nThe information on individual cases of affix borrowing varies in terms of reliability, either because information is lacking in available descriptions or the descriptions themselves acknowledge uncertainties. The reliability of data is coded as high (66 cases), mid (31 cases), or low (4 cases) in the database. Most often this refers to uncertainty of the borrowed status, due to lack of comparative evidence or to uncertainty with respect to its status as an affix (vs. free form).\nRepresentation of data ⇫\n\nData are given throughout as in the original sources, i.e. no attempt at standardization through transliteration was made.\n\n\n## Using and citing AfBo\n\nIf you go back to the original resource, on which descriptions of affix borrowing in AfBo are based, that original resource should be cited. If you refer to results obtained from AfBo, such as the frequency of borrowing affixes with a specific function, you should cite AfBo as\n\n> Seifart, Frank. 2013. AfBo: A world-wide survey of affix borrowing. Leipzig: Max Planck Institute for Evolutionary Anthropology. (Available online at https://afbo.info)\n\n## Acknowledgements\n\nMany people have contributed to building AfBo, as explicitly noted in the descriptions of individual case of affix borrowing. In addition, I am grateful to Martin Haspelmath for publishing AfBo as part of the Cross-Linguistic Linked Data project, to Robert Forkel for programming the web interface, and to Lena Sell, Lisa Steinbach, and Evgeniya Zhivotova for proofreading.\n",
    "dc:identifier": "https://afbo.info/",
    "dc:license": "https://creativecommons.org/licenses/by/4.0/",
    "dc:source": "sources.bib",
    "dc:title": "AfBo: A world-wide survey of affix borrowing",
    "dcat:accessURL": "https://github.com/cldf-datasets/afbo",
    "prov:wasDerivedFrom": [
        {
            "rdf:type": "prov:Entity",
            "dc:title": "Repository",
            "rdf:about": "https://github.com/cldf-datasets/afbo",
            "dc:created": "824e43a"
        },
        {
            "rdf:type": "prov:Entity",
            "dc:title": "Glottolog",
            "rdf:about": "https://github.com/glottolog/glottolog",
            "dc:created": "v4.1"
        }
    ],
    "prov:wasGeneratedBy": [
        {
            "dc:title": "python",
            "dc:description": "3.5.2"
        },
        {
            "dc:title": "python-packages",
            "dc:relation": "requirements.txt"
        }
    ],
    "rdf:ID": "afbo",
    "rdf:type": "http://www.w3.org/ns/dcat#Distribution",
    "dialect": {
        "commentPrefix": null
    },
    "tables": [
        {
            "dc:conformsTo": "http://cldf.clld.org/v1.0/terms.rdf#ValueTable",
            "dc:extent": 290,
            "tableSchema": {
                "columns": [
                    {
                        "datatype": {
                            "base": "string",
                            "format": "[a-zA-Z0-9_\\-]+"
                        },
                        "propertyUrl": "http://cldf.clld.org/v1.0/terms.rdf#id",
                        "required": true,
                        "name": "ID"
                    },
                    {
                        "datatype": "string",
                        "propertyUrl": "http://cldf.clld.org/v1.0/terms.rdf#languageReference",
                        "required": true,
                        "name": "Language_ID"
                    },
                    {
                        "datatype": "string",
                        "propertyUrl": "http://cldf.clld.org/v1.0/terms.rdf#parameterReference",
                        "required": true,
                        "name": "Parameter_ID"
                    },
                    {
                        "dc:description": "The number of borrowed affixes of a certain function from a certain donor language",
                        "datatype": "string",
                        "null": [
                            "?",
                            ""
                        ],
                        "propertyUrl": "http://cldf.clld.org/v1.0/terms.rdf#value",
                        "required": false,
                        "name": "Value"
                    },
                    {
                        "datatype": "string",
                        "name": "Pair_ID"
                    }
                ],
                "foreignKeys": [
                    {
                        "columnReference": [
                            "Language_ID"
                        ],
                        "reference": {
                            "resource": "languages.csv",
                            "columnReference": [
                                "ID"
                            ]
                        }
                    },
                    {
                        "columnReference": [
                            "Parameter_ID"
                        ],
                        "reference": {
                            "resource": "parameters.csv",
                            "columnReference": [
                                "ID"
                            ]
                        }
                    },
                    {
                        "columnReference": [
                            "Pair_ID"
                        ],
                        "reference": {
                            "resource": "donor_recipient_pairs.csv",
                            "columnReference": [
                                "ID"
                            ]
                        }
                    }
                ],
                "primaryKey": [
                    "ID"
                ]
            },
            "url": "values.csv"
        },
        {
            "dc:conformsTo": "http://cldf.clld.org/v1.0/terms.rdf#LanguageTable",
            "dc:extent": 159,
            "tableSchema": {
                "columns": [
                    {
                        "datatype": {
                            "base": "string",
                            "format": "[a-zA-Z0-9_\\-]+"
                        },
                        "propertyUrl": "http://cldf.clld.org/v1.0/terms.rdf#id",
                        "required": true,
                        "name": "ID"
                    },
                    {
                        "datatype": "string",
                        "propertyUrl": "http://cldf.clld.org/v1.0/terms.rdf#name",
                        "required": false,
                        "name": "Name"
                    },
                    {
                        "datatype": "string",
                        "propertyUrl": "http://cldf.clld.org/v1.0/terms.rdf#macroarea",
                        "required": false,
                        "name": "Macroarea"
                    },
                    {
                        "datatype": {
                            "base": "decimal",
                            "minimum": -90,
                            "maximum": 90
                        },
                        "propertyUrl": "http://cldf.clld.org/v1.0/terms.rdf#latitude",
                        "required": false,
                        "name": "Latitude"
                    },
                    {
                        "datatype": {
                            "base": "decimal",
                            "minimum": -180,
                            "maximum": 180
                        },
                        "propertyUrl": "http://cldf.clld.org/v1.0/terms.rdf#longitude",
                        "required": false,
                        "name": "Longitude"
                    },
                    {
                        "datatype": {
                            "base": "string",
                            "format": "[a-z0-9]{4}[1-9][0-9]{3}"
                        },
                        "propertyUrl": "http://cldf.clld.org/v1.0/terms.rdf#glottocode",
                        "required": false,
                        "valueUrl": "http://glottolog.org/resource/languoid/id/{glottocode}",
                        "name": "Glottocode"
                    },
                    {
                        "datatype": {
                            "base": "string",
                            "format": "[a-z]{3}"
                        },
                        "propertyUrl": "http://cldf.clld.org/v1.0/terms.rdf#iso639P3code",
                        "required": false,
                        "name": "ISO639P3code"
                    },
                    {
                        "datatype": "string",
                        "name": "Afbo_Macroarea"
                    },
                    {
                        "datatype": "string",
                        "name": "Genus"
                    }
                ],
                "primaryKey": [
                    "ID"
                ]
            },
            "url": "languages.csv"
        },
        {
            "dc:conformsTo": "http://cldf.clld.org/v1.0/terms.rdf#ParameterTable",
            "dc:description": "Affix functions",
            "dc:extent": 43,
            "tableSchema": {
                "columns": [
                    {
                        "datatype": {
                            "base": "string",
                            "format": "[a-zA-Z0-9_\\-]+"
                        },
                        "propertyUrl": "http://cldf.clld.org/v1.0/terms.rdf#id",
                        "required": true,
                        "name": "ID"
                    },
                    {
                        "datatype": "string",
                        "propertyUrl": "http://cldf.clld.org/v1.0/terms.rdf#name",
                        "required": false,
                        "name": "Name"
                    },
                    {
                        "datatype": "string",
                        "propertyUrl": "http://cldf.clld.org/v1.0/terms.rdf#description",
                        "required": false,
                        "name": "Description"
                    },
                    {
                        "datatype": "integer",
                        "name": "Representation"
                    },
                    {
                        "datatype": "integer",
                        "name": "Count_Borrowed"
                    }
                ],
                "primaryKey": [
                    "ID"
                ]
            },
            "url": "parameters.csv"
        },
        {
            "dc:extent": 101,
            "tableSchema": {
                "columns": [
                    {
                        "datatype": "string",
                        "name": "ID"
                    },
                    {
                        "datatype": "string",
                        "name": "Name"
                    },
                    {
                        "datatype": "string",
                        "propertyUrl": "http://cldf.clld.org/v1.0/terms.rdf#source",
                        "separator": ";",
                        "name": "Source"
                    },
                    {
                        "datatype": "string",
                        "name": "Donor_ID"
                    },
                    {
                        "datatype": "string",
                        "name": "Recipient_ID"
                    },
                    {
                        "dc:format": "text/html",
                        "name": "Description"
                    },
                    {
                        "datatype": "string",
                        "name": "Afbo_Macroarea"
                    },
                    {
                        "datatype": "string",
                        "name": "Reliability"
                    },
                    {
                        "datatype": "integer",
                        "name": "Count_Interrelated"
                    },
                    {
                        "datatype": "integer",
                        "name": "Count_Borrowed"
                    }
                ],
                "foreignKeys": [
                    {
                        "columnReference": [
                            "Donor_ID"
                        ],
                        "reference": {
                            "resource": "languages.csv",
                            "columnReference": [
                                "ID"
                            ]
                        }
                    },
                    {
                        "columnReference": [
                            "Recipient_ID"
                        ],
                        "reference": {
                            "resource": "languages.csv",
                            "columnReference": [
                                "ID"
                            ]
                        }
                    }
                ]
            },
            "url": "donor_recipient_pairs.csv"
        }
    ]
}